print('Придумайте имя героя')
hero = input()
print('Назовите возраст героя')
age_hero = input()
print('Как зовут злодея?')
villain = input()
print('Напишите название королевства')
kingdom = input()
print('Назовите трудности, с которыми столкнулся герой')
hero_difficulties = input()
print('Какое оружие у героя?')
weapon = input()
print('Какая магическая способность у злодея?')
villain_ability = input()
print('Где они встретились?')
place = input()
print('Счастливый конец? Ответ "да" или "нет".')
the_end = input()

if the_end.lower() == 'да':
    story = f'''\tЖил-был в королевстве {kingdom} герой {hero}. Было ему {age_hero} лет.   
    Все жители королевства любили его за смелость и честность.   
    Однажды на королевство напал злой {villain}. Все пытались скрыться, но {hero} не испугался.  
    Он взял свое верное оружие - {weapon} и отправился на бой с {villain}.   
    В пути он преодолел многие трудности: {hero_difficulties}. Но каждое испытание лишь укрепляло его дух.  
    Наконец, он достиг {place} {villain}, и началась великая битва.  
    Долго сражался {hero} с злодеем. {hero} боролся при помощи {weapon}, а {villain} использовал свою   
    магическую способность - {villain_ability}.  
    {hero} поверг его на землю, и враг, осознав свою ошибку, поклялся больше не угрожать людям.  
    После победы королевство {kingdom} снова стало мирным. {hero} вернулся домой героем.  
    С тех пор они жили долго и счастливо. Тут и сказочке конец, а кто слушал — молодец!'''
else:
    story = f'''\tЖил-был в королевстве {kingdom} герой {hero}. Было ему {age_hero} лет.   
    Все жители королевства любили его за смелость и честность.   
    Однажды на королевство напал злой {villain}. Все пытались скрыться, но {hero} не испугался.  
    Он взял свое верное оружие - {weapon} и отправился на бой с {villain}.   
    В пути он преодолел многие трудности: {hero_difficulties}. Наконец, он нашел {villain} в {place}.   
    И вот, началась великая битва. {villain} был силен, и хотя {hero} сражался отважно, он не мог одолеть {villain}.  
    {villain_ability} врага были слишком сильны.   
    Наконец, когда силы героя иссякли, {villain} схватил {hero} и поднял его в воздух:  
    - Ты будешь моим пленником, и я отнесу тебя в глубины подземелья.   
    {hero} не вернулся. Силы в королевстве иссякли, а народ, оставшийся без защитника, был обречен.   
    С тех пор королевство {kingdom} стало тенью того, чем оно было когда-то.   
    Земли опустели, а народ ушел в изгнание, оставив только легенды о {hero}, который пытался спасти их мир.   
    Тут и сказочке конец, а кто слушал — молодец.'''

print(story)