print('Задайте строку')
s = input()

while True:
    print('''Укажите номер варианта, что Вы хотите сделать с данной строкой?  
    1. показать текущую строку в двойных кавычках и в скобках её длину')    2. заменить текущую строку, прочитав новую    3. внести следующие изменения:    4. проверить:    5. подсчитать количество    6. завершить работу''')

    ans = int(input())
    if ans == 1:
        print(f'"{s}" ({len(s)})')
    elif ans == 2:
        print('Задайте новую строку, на которую заменится строка:')
        a = input()
        n_s = s.replace(s, a)
        print(n_s)
    elif ans == 3:
        print('''заменить первое вхождение заданной подстроки на другую и   
        дополнить строку спереди нулями до заданной длины''')
        print('Задайте новую строку, на которую будет изменена строка')
        new_s = input()
        print('Задайте длину строки')
        d = int(input())
        print(f'{s.replace(s, new_s, 1):0>{d}}')
    elif ans == 4:
        print('''Проверка может ли строка быть адресом сайта:   
        есть хотя бы одна точка, нет подряд идущих точек, начинается и заканчивается не точкой''')
        if s.count('.') > 0 and '..' not in s and s[0] != '.' and s[-1] != '.':
            print('Да')
        else:
            print('Нет')
    elif ans == 5:
        print('количество букв и цифр в текущей строке')
        num = [int(x) for x in s if x.isdigit()]
        print(f'Буквы:{len(s) - len(num)} Цифры:{len(num)}')
    elif ans == 6:
        break